Repository: a9ravic/CleanLock
Catalog: CleanLock/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, en, es, fr, hi, pt_br

# about
source: 关于 CleanLock
ar: حول CleanLock
en: About CleanLock
es: Acerca de CleanLock
fr: À propos de CleanLock
hi: CleanLock के बारे में
pt_br: Sobre o CleanLock

# accessibility_description
source: CleanLock 需要辅助功能权限来拦截键盘输入，防止清洁键盘时误触。
ar: يحتاج CleanLock إلى إذن الوصول لاعتراض إدخال لوحة المفاتيح ومنع الكتابة العرضية أثناء التنظيف.
en: CleanLock needs accessibility permission to intercept keyboard input and prevent accidental typing while cleaning.
es: CleanLock necesita permiso de accesibilidad para interceptar la entrada del teclado y evitar escritura accidental durante la limpieza.
fr: CleanLock a besoin de l'autorisation d'accessibilité pour intercepter les entrées clavier et éviter la frappe accidentelle pendant le nettoyage.
hi: CleanLock को कीबोर्ड इनपुट को रोकने और सफाई के दौरान गलती से टाइपिंग को रोकने के लिए एक्सेसिबिलिटी अनुमति की आवश्यकता है।
pt_br: CleanLock precisa de permissão de acessibilidade para interceptar a entrada do teclado e evitar digitação acidental durante a limpeza.

# app_tagline
source: 键盘清洁助手
ar: مساعد تنظيف لوحة المفاتيح
en: Keyboard Cleaning Assistant
es: Asistente de limpieza de teclado
fr: Assistant de nettoyage clavier
hi: कीबोर्ड सफाई सहायक
pt_br: Assistente de limpeza de teclado

# cancel
source: 取消
ar: إلغاء
en: Cancel
es: Cancelar
fr: Annuler
hi: रद्द करें
pt_br: Cancelar

# cleaning_complete
source: 清洁完成
ar: اكتمل التنظيف
en: Cleaning Complete
es: Limpieza completada
fr: Nettoyage terminé
hi: सफाई पूर्ण
pt_br: Limpeza concluída

# cleaning_instruction
source: 擦拭键盘，按下的键会亮起
ar: امسح لوحة المفاتيح، المفاتيح المضغوطة ستضيء
en: Wipe the keyboard, pressed keys will light up
es: Limpia el teclado, las teclas presionadas se iluminarán
fr: Essuyez le clavier, les touches pressées s'allumeront
hi: कीबोर्ड साफ करें, दबाई गई कुंजियाँ जलेंगी
pt_br: Limpe o teclado, as teclas pressionadas acenderão

# continue
source: 继续
ar: متابعة
en: Continue
es: Continuar
fr: Continuer
hi: जारी रखें
pt_br: Continuar

# enable
source: 启用
ar: تمكين
en: Enable
es: Habilitar
fr: Activer
hi: सक्षम करें
pt_br: Ativar

# exit_hint
source: 长按 ESC 3秒退出
ar: اضغط ESC لمدة 3 ثوانٍ للخروج
en: Hold ESC for 3 seconds to exit
es: Mantén ESC 3 segundos para salir
fr: Maintenez ESC pendant 3 secondes pour quitter
hi: बाहर निकलने के लिए ESC को 3 सेकंड दबाएं
pt_br: Segure ESC por 3 segundos para sair

# feature_auto_desc
source: 全部清洁完成后自动退出
ar: يخرج تلقائياً عند تنظيف جميع المفاتيح
en: Automatically exits when all keys are cleaned
es: Sale automáticamente cuando todas las teclas están limpias
fr: Quitte automatiquement quand toutes les touches sont nettoyées
hi: सभी कुंजियाँ साफ होने पर स्वचालित रूप से बाहर निकलें
pt_br: Sai automaticamente quando todas as teclas estão limpas

# feature_auto_title
source: 自动解锁
ar: فتح تلقائي
en: Auto Unlock
es: Desbloqueo automático
fr: Déverrouillage auto
hi: ऑटो अनलॉक
pt_br: Desbloqueio automático

# feature_shortcut_desc
source: 按下 ⌘⇧K 快速启动清洁模式
ar: اضغط ⌘⇧K لبدء وضع التنظيف بسرعة
en: Press ⌘⇧K to quickly start cleaning mode
es: Presiona ⌘⇧K para iniciar rápidamente el modo limpieza
fr: Appuyez sur ⌘⇧K pour démarrer rapidement le mode nettoyage
hi: सफाई मोड शुरू करने के लिए ⌘⇧K दबाएं
pt_br: Pressione ⌘⇧K para iniciar rapidamente o modo limpeza

# feature_shortcut_title
source: 快捷启动
ar: بدء سريع
en: Quick Start
es: Inicio rápido
fr: Démarrage rapide
hi: त्वरित प्रारंभ
pt_br: Início rápido

# feature_visual_desc
source: 按下的键会亮起表示已清洁
ar: المفاتيح المضغوطة تضيء لتظهر أنها نظيفة
en: Pressed keys light up to show they're cleaned
es: Las teclas presionadas se iluminan para mostrar que están limpias
fr: Les touches pressées s'allument pour indiquer qu'elles sont nettoyées
hi: दबाई गई कुंजियाँ साफ होने का संकेत देने के लिए जलती हैं
pt_br: As teclas pressionadas acendem para mostrar que foram limpas

# feature_visual_title
source: 可视化清洁
ar: تنظيف مرئي
en: Visual Cleaning
es: Limpieza visual
fr: Nettoyage visuel
hi: विज़ुअल सफाई
pt_br: Limpeza visual

# get_started
source: 开始使用
ar: ابدأ الآن
en: Get Started
es: Comenzar
fr: Commencer
hi: शुरू करें
pt_br: Começar

# i_have_enabled
source: 我已开启
ar: لقد قمت بتمكينه
en: I've Enabled It
es: Ya lo habilité
fr: Je l'ai activé
hi: मैंने सक्षम कर दिया है
pt_br: Já ativei

# instruction_1
source: 按下的键会亮起表示已清洁
ar: المفاتيح المضغوطة تضيء لتظهر أنها نظيفة
en: Pressed keys light up to show they're cleaned
es: Las teclas presionadas se iluminan para mostrar que están limpias
fr: Les touches pressées s'allument pour indiquer qu'elles sont nettoyées
hi: दबाई गई कुंजियाँ साफ होने का संकेत देने के लिए जलती हैं
pt_br: As teclas pressionadas acendem para mostrar que foram limpas

# instruction_2
source: 全部清洁完成后自动退出
ar: يخرج تلقائياً عند تنظيف جميع المفاتيح
en: Automatically exits when all keys are cleaned
es: Sale automáticamente cuando todas las teclas están limpias
fr: Quitte automatiquement quand toutes les touches sont nettoyées
hi: सभी कुंजियाँ साफ होने पर स्वचालित रूप से बाहर निकलें
pt_br: Sai automaticamente quando todas as teclas estão limpas

# instruction_3
source: 长按 ESC 键可提前退出
ar: اضغط ESC للخروج مبكراً
en: Hold ESC to exit early
es: Mantén ESC para salir antes
fr: Maintenez ESC pour quitter plus tôt
hi: जल्दी बाहर निकलने के लिए ESC दबाएं
pt_br: Segure ESC para sair antes

# instructions
source: 使用说明
ar: التعليمات
en: Instructions
es: Instrucciones
fr: Instructions
hi: निर्देश
pt_br: Instruções

# key_unit
source: 键
ar: مفاتيح
en: keys
es: teclas
fr: touches
hi: कुंजियाँ
pt_br: teclas

# later
source: 稍后再说
ar: لاحقاً
en: Later
es: Más tarde
fr: Plus tard
hi: बाद में
pt_br: Mais tarde

# launch_at_login
source: 开机自动启动
ar: تشغيل عند الدخول
en: Launch at Login
es: Iniciar al arrancar
fr: Lancer au démarrage
hi: लॉगिन पर लॉन्च करें
pt_br: Iniciar no login

# open_settings
source: 打开系统设置
ar: فتح إعدادات النظام
en: Open System Settings
es: Abrir Configuración
fr: Ouvrir les Préférences Système
hi: सिस्टम सेटिंग्स खोलें
pt_br: Abrir Configurações do Sistema

# open_system_settings
source: 打开系统设置
ar: فتح إعدادات النظام
en: Open System Settings
es: Abrir Configuración del Sistema
fr: Ouvrir les Réglages Système
hi: सिस्टम सेटिंग्स खोलें
pt_br: Abrir Configurações do Sistema

# permission_basic
source: 基础模式
ar: الوضع الأساسي
en: Basic Mode
es: Modo básico
fr: Mode basique
hi: बेसिक मोड
pt_br: Modo básico

# permission_benefit_1_desc
source: 包括 F1-F12 功能键，避免触发亮度、音量、调度中心等系统功能
ar: بما في ذلك مفاتيح F1-F12، لمنع السطوع والصوت و Mission Control وما إلى ذلك
en: Including F1-F12 function keys, preventing brightness, volume, Mission Control, etc.
es: Incluyendo teclas F1-F12, evitando brillo, volumen, Mission Control, etc.
fr: Y compris les touches F1-F12, empêchant luminosité, volume, Mission Control, etc.
hi: F1-F12 फ़ंक्शन कुंजियों सहित, ब्राइटनेस, वॉल्यूम, Mission Control आदि को रोकें
pt_br: Incluindo teclas F1-F12, evitando brilho, volume, Mission Control, etc.

# permission_benefit_1_title
source: 拦截所有按键
ar: اعتراض جميع المفاتيح
en: Intercept All Keys
es: Interceptar todas las teclas
fr: Intercepter toutes les touches
hi: सभी कुंजियों को रोकें
pt_br: Interceptar todas as teclas

# permission_benefit_2_desc
source: 清洁时不会意外触发系统快捷键或切换应用
ar: لا اختصارات نظام عرضية أو تبديل تطبيقات أثناء التنظيف
en: No accidental system shortcuts or app switching while cleaning
es: Sin atajos del sistema accidentales ni cambio de aplicaciones
fr: Pas de raccourcis système accidentels ni de changement d'application
hi: सफाई के दौरान कोई आकस्मिक सिस्टम शॉर्टकट या ऐप स्विचिंग नहीं
pt_br: Sem atalhos do sistema acidentais ou troca de aplicativos

# permission_benefit_2_title
source: 更好的清洁体验
ar: تجربة تنظيف أفضل
en: Better Cleaning Experience
es: Mejor experiencia de limpieza
fr: Meilleure expérience de nettoyage
hi: बेहतर सफाई अनुभव
pt_br: Melhor experiência de limpeza

# permission_desc
source: 为了在清洁时拦截键盘输入防止误触， 请在系统设置中授予辅助功能权限
ar: لاعتراض إدخال لوحة المفاتيح أثناء التنظيف، يرجى منح إذن الوصول في إعدادات النظام
en: To intercept keyboard input while cleaning, please grant accessibility permission in System Settings
es: Para interceptar la entrada del teclado durante la limpieza, por favor otorga permiso de accesibilidad en Configuración del Sistema
fr: Pour intercepter les entrées clavier pendant le nettoyage, veuillez accorder l'autorisation d'accessibilité dans les Réglages Système
hi: सफाई के दौरान कीबोर्ड इनपुट को रोकने के लिए, कृपया सिस्टम सेटिंग्स में एक्सेसिबिलिटी अनुमति दें
pt_br: Para interceptar a entrada do teclado durante a limpeza, por favor conceda permissão de acessibilidade nas Configurações do Sistema

# permission_full
source: 完整模式
ar: الوضع الكامل
en: Full Mode
es: Modo completo
fr: Mode complet
hi: पूर्ण मोड
pt_br: Modo completo

# permission_granted
source: 权限已授予
ar: تم منح الإذن
en: Permission Granted
es: Permiso otorgado
fr: Autorisation accordée
hi: अनुमति प्रदान की गई
pt_br: Permissão concedida

# permission_granted_desc
source: CleanLock 现在可以拦截所有按键，享受完整的清洁体验！
ar: يمكن لـ CleanLock الآن اعتراض جميع المفاتيح. استمتع بالتجربة الكاملة!
en: CleanLock can now intercept all keys. Enjoy the full cleaning experience!
es: CleanLock ahora puede interceptar todas las teclas. ¡Disfruta la experiencia completa!
fr: CleanLock peut maintenant intercepter toutes les touches. Profitez de l'expérience complète !
hi: CleanLock अब सभी कुंजियों को रोक सकता है। पूर्ण अनुभव का आनंद लें!
pt_br: CleanLock agora pode interceptar todas as teclas. Aproveite a experiência completa!

# permission_limited
source: 基础模式
ar: الوضع الأساسي
en: Basic Mode
es: Modo básico
fr: Mode basique
hi: बेसिक मोड
pt_br: Modo básico

# permission_limited_desc
source: F1-F12 功能键将自动跳过，启用辅助功能可清洁所有按键
ar: تم تخطي مفاتيح F1-F12. قم بتمكين إمكانية الوصول لتنظيف الكل.
en: F1-F12 keys auto-skipped. Enable accessibility to clean all keys.
es: Teclas F1-F12 omitidas. Habilita accesibilidad para limpiar todas.
fr: Touches F1-F12 ignorées. Activez l'accessibilité pour tout nettoyer.
hi: F1-F12 कुंजियाँ छोड़ी गईं। सभी को साफ करने के लिए एक्सेसिबिलिटी सक्षम करें।
pt_br: Teclas F1-F12 puladas. Ative acessibilidade para limpar todas.

# permission_required
source: 需要辅助功能权限
ar: مطلوب إذن الوصول
en: Accessibility Permission Required
es: Se requiere permiso de accesibilidad
fr: Autorisation d'accessibilité requise
hi: एक्सेसिबिलिटी अनुमति आवश्यक
pt_br: Permissão de acessibilidade necessária

# permission_required_desc
source: CleanLock 需要辅助功能权限才能拦截所有键盘按键，包括 F1-F12 功能键。
ar: يحتاج CleanLock إلى إذن إمكانية الوصول لاعتراض جميع مفاتيح لوحة المفاتيح.
en: CleanLock needs accessibility permission to intercept all keyboard keys, including F1-F12 function keys.
es: CleanLock necesita permiso de accesibilidad para interceptar todas las teclas, incluidas F1-F12.
fr: CleanLock a besoin de l'autorisation d'accessibilité pour intercepter toutes les touches.
hi: CleanLock को सभी कीबोर्ड कुंजियों को इंटरसेप्ट करने के लिए एक्सेसिबिलिटी अनुमति चाहिए।
pt_br: CleanLock precisa de permissão de acessibilidade para interceptar todas as teclas.

# permission_required_title
source: 需要辅助功能权限
ar: مطلوب إذن إمكانية الوصول
en: Accessibility Permission Required
es: Se requiere permiso de accesibilidad
fr: Autorisation d'accessibilité requise
hi: एक्सेसिबिलिटी अनुमति आवश्यक
pt_br: Permissão de acessibilidade necessária

# permission_setup_desc
source: 授予辅助功能权限后，CleanLock 可以拦截所有按键，包括 F1-F12 功能键，避免触发系统功能。
ar: مع إذن الوصول، يمكن لـ CleanLock اعتراض جميع المفاتيح بما في ذلك F1-F12.
en: With accessibility permission, CleanLock can intercept all keys including F1-F12, preventing system functions from triggering.
es: Con permiso de accesibilidad, CleanLock puede interceptar todas las teclas incluyendo F1-F12, evitando que se activen funciones del sistema.
fr: Avec l'autorisation d'accessibilité, CleanLock peut intercepter toutes les touches, y compris F1-F12.
hi: एक्सेसिबिलिटी अनुमति के साथ, CleanLock F1-F12 सहित सभी कुंजियों को रोक सकता है।
pt_br: Com permissão de acessibilidade, CleanLock pode interceptar todas as teclas, incluindo F1-F12.

# permission_setup_title
source: 开启完整功能
ar: تمكين الميزات الكاملة
en: Enable Full Features
es: Habilitar funciones completas
fr: Activer toutes les fonctionnalités
hi: पूर्ण सुविधाएं सक्षम करें
pt_br: Ativar recursos completos

# permission_step_1
source: 点击下方按钮打开系统设置
ar: انقر على الزر أدناه لفتح إعدادات النظام
en: Click the button below to open System Settings
es: Haz clic en el botón para abrir Configuración
fr: Cliquez sur le bouton pour ouvrir les Préférences Système
hi: सिस्टम सेटिंग्स खोलने के लिए नीचे बटन पर क्लिक करें
pt_br: Clique no botão para abrir Configurações do Sistema

# permission_step_2
source: 点击 + 号，选择 CleanLock 并添加
ar: انقر على +، حدد CleanLock وأضفه
en: Click +, select CleanLock and add it
es: Haz clic en +, selecciona CleanLock y añádelo
fr: Cliquez sur +, sélectionnez CleanLock et ajoutez-le
hi: + पर क्लिक करें, CleanLock चुनें और जोड़ें
pt_br: Clique em +, selecione CleanLock e adicione-o

# permission_step_3
source: 返回此应用，权限将自动生效
ar: ارجع إلى هذا التطبيق، سيتم تطبيق الإذن تلقائياً
en: Return to this app, permission will take effect automatically
es: Vuelve a esta app, el permiso se aplicará automáticamente
fr: Revenez à cette app, l'autorisation prendra effet automatiquement
hi: इस ऐप पर वापस आएं, अनुमति स्वचालित रूप से लागू होगी
pt_br: Volte para este app, a permissão será aplicada automaticamente

# press_shortcut
source: 按下快捷键...
ar: اضغط الاختصار...
en: Press shortcut...
es: Presiona un atajo...
fr: Appuyez sur un raccourci...
hi: शॉर्टकट दबाएं...
pt_br: Pressione um atalho...

# quit
source: 退出
ar: إنهاء
en: Quit
es: Salir
fr: Quitter
hi: बाहर निकलें
pt_br: Sair

# restore_default
source: 恢复默认
ar: استعادة الافتراضي
en: Restore Default
es: Restaurar predeterminado
fr: Restaurer par défaut
hi: डिफ़ॉल्ट पुनर्स्थापित करें
pt_br: Restaurar padrão

# save
source: 保存
ar: حفظ
en: Save
es: Guardar
fr: Enregistrer
hi: सहेजें
pt_br: Salvar

# settings_title
source: 快捷键设置
ar: إعدادات الاختصارات
en: Shortcut Settings
es: Configuración de atajos
fr: Réglages des raccourcis
hi: शॉर्टकट सेटिंग्स
pt_br: Configurações de atalhos

# shortcut
source: 快捷键
ar: اختصار
en: Shortcut
es: Atajo
fr: Raccourci
hi: शॉर्टकट
pt_br: Atalho

# shortcut_label
source: 启动清洁模式的快捷键
ar: اختصار لبدء وضع التنظيف
en: Shortcut to start cleaning mode
es: Atajo para iniciar modo limpieza
fr: Raccourci pour démarrer le mode nettoyage
hi: सफाई मोड शुरू करने का शॉर्टकट
pt_br: Atalho para iniciar modo limpeza

# shortcut_settings
source: 快捷键设置...
ar: إعدادات الاختصارات...
en: Shortcut Settings...
es: Configuración de atajos...
fr: Réglages des raccourcis...
hi: शॉर्टकट सेटिंग्स...
pt_br: Configurações de atalhos...

# skip_for_now
source: 暂时跳过
ar: تخطي الآن
en: Skip for Now
es: Omitir por ahora
fr: Ignorer pour l'instant
hi: अभी के लिए छोड़ें
pt_br: Pular por enquanto

# start_cleaning
source: 开始清洁
ar: بدء التنظيف
en: Start Cleaning
es: Iniciar limpieza
fr: Démarrer le nettoyage
hi: सफाई शुरू करें
pt_br: Iniciar limpeza

# welcome_subtitle
source: 清洁 MacBook 键盘时锁定键盘防止误触
ar: قفل لوحة المفاتيح أثناء التنظيف لمنع الإدخال العرضي
en: Lock keyboard while cleaning to prevent accidental input
es: Bloquea el teclado mientras limpias para evitar toques accidentales
fr: Verrouillez le clavier pendant le nettoyage pour éviter les frappes accidentelles
hi: सफाई के दौरान गलती से इनपुट रोकने के लिए कीबोर्ड लॉक करें
pt_br: Bloqueie o teclado durante a limpeza para evitar toques acidentais

# welcome_title
source: 欢迎使用 CleanLock
ar: مرحباً بك في CleanLock
en: Welcome to CleanLock
es: Bienvenido a CleanLock
fr: Bienvenue dans CleanLock
hi: CleanLock में आपका स्वागत है
pt_br: Bem-vindo ao CleanLock
